d-emacs.org
#+TITLE: 🧬 D Emacs Station
#+PROPERTY: header-args:emacs-lisp :tangle ./gdk/i-home/configs/emacs/init.el :tangle-mode (identity #o444) :mkdirp yes
#+TOC: tables


** Todo Stuffs (Feel free to say/add something. I will be glad!
**** 😄 Finally Done.. Ooof 
CLOSED: [2023-03-07 Tue 14:27]
:LOGBOOK:
- CLOSING NOTE [2023-03-07 Tue 14:27]
:END:
- [X] Ditch evil-mode, go pure Emacs way!
- [X] No need modeline nor dashboard, go zen-mode with minimal distraction
    PS : Used ~olivetti-mode~ and ~hide-mode-line-mode~
- [X] Clean and minimise unnecessary package/bloat
- [X] No need doom-themes too, use one theme (Either vivendi or Catppuccin)
- [X] Setup robust and extensive use for Rss feeds
- [X] Manage emacs nix-way.
  PS : Just managing packages in nix style. Init file is good enough as such.
    Benefits are :
  + package management becomes easy with just ~nixos-rebuild~
  + You get vterm, which wont build that easily in normal emacs config under nixos
- [X] Make README.org or improve this Config.org so it is informational to all
- [X] Share some cool stuffs with others and explain it very crisp and clearly
    
**** 😴 Planning  [0/5]
- [ ] add these stuffs.
  #+begin_src conf

;; Enable `diff-hl' support by default in programming buffers
(add-hook 'prog-mode-hook #'diff-hl-mode)

;; Update the highlighting without saving
(diff-hl-flydiff-mode t)

  #+end_src
- [ ] Add daily quotes for ~initial-scratch-message~
- [ ] Learn more stuffs from Experienced and Master Users, like Purcell, bbsatov and others
- [ ] Learn elisp for enhancing some more stuffs


** ✨ TLDWR - Features
/too long, don't wanna read/

Some of the highlights which you might wanna copy or take from this config :

1. RSS focused, has good workflow to read. You have bionic-reading too!
2. Smoother experience and made for Pure-Gtk, Wayland use
3. Zen, Distraction free text viewing experience (No mode-line)


* 🌅 Early-Init 
#+begin_src emacs-lisp :noweb yes :tangle ./gdk/i-home/configs/emacs/early-init.el :tangle-mode (identity #o444) :mkdirp yes
  ;;; early-init.el ---   -*- lexical-binding: t -*-

  ;;; Commentary:

  ;;

  ;;; Code:

  (setq package-enable-at-startup nil) ; don't auto-initialize!
  (setq package-archives nil)

  (setq
   load-prefer-newer nil
   default-input-method nil
   initial-major-mode 'org-mode
   inhibit-default-init t
   inhibit-startup-screen t 	
   inhibit-startup-buffer-menu t)

  ;; Maximize the Emacs frame on startup
  (push '(fullscreen . maximized) default-frame-alist)

  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.

  (setq default-frame-alist
        '((menu-bar-lines . 0)
          (tool-bar-lines . 0)
          (horizontal-scroll-bars)
          (vertical-scroll-bars)))

  ;; Suppress warnings and errors during asynchronous native compilation
  (setq native-comp-async-report-warnings-errors nil)
  (setq native-comp-jit-compilation nil)

  (load-theme 'modus-vivendi-tinted t)
  ;; Do not resize the frame at this early stage.
  (setq frame-inhibit-implied-resize t)

  (provide 'early-init)
  ;;; early-init.el ends here
    #+end_src  

* 🔰 Start-ify 
Manage Font size, Initialize Package setup and sends you startup time (Daemonize 👹 your Emacs)
#+begin_src emacs-lisp
  ;;; Personal configuration -*- lexical-binding: t -*-

  ;;; Commentary:

  ;; No need write this file, do it in literate org file!

  ;;; Code:

  ;; Lets garbage collect to make emacs quicker! 

  (defun my-cleanup-gc ()
    "Clean up gc."
    (setq gc-cons-threshold  67108864) ; 64M
    (setq gc-cons-percentage 0.1) ; original value
    (garbage-collect))

  (run-with-idle-timer 4 nil #'my-cleanup-gc)

  (message "  Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time (time-subtract after-init-time before-init-time)))
           gcs-done)

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  #+end_src

* 🔤 Fontify 
Fonts are crucial to read.
#+begin_src emacs-lisp
  ;; You will most likely need to adjust this font size for your system!
  (defvar default-font-size 170)
  (defvar default-variable-font-size 170)

  ;; Set reusable font name variables
  (defvar d/fixed-width-font "ComicCodeLigatures Nerd Font"
    "The font to use for monospaced (fixed width) text.")

  (defvar d/variable-width-font "ComicCodeLigatures Nerd Font"
    "The font to use for variable-pitch (document) text.")

  (defvar d/header-font "Comic Mono"
    "Font for header level in org-mode." )

  (defvar d/sans-font "SF Pro Rounded"
    "Sans font for reading docs or presentation")
  (defvar d/jetb-font "JetBrainsMono Nerd Font"
    "Jetbrains font for code/verbatim" )
  (defvar d/title-face "Impress BT"
    "Font for title")
  (defvar d/link-font "VictorMono Nerd Font"
    "Font for links")
  (defvar d/code-font "VictorMono Nerd Font"
    "Font for inline code")


  (setf use-default-font-for-symbols nil)
  (set-fontset-font t 'unicode "Noto Emoji" nil 'append)

  (defun d/set-font-faces ()
    (message "Setting faces!")
    (set-face-attribute 'default nil :font d/variable-width-font :weight 'medium :height default-font-size)

    ;; Set the fixed pitch face (monospace)
    (set-face-attribute 'fixed-pitch nil :font d/fixed-width-font :height default-font-size)

    ;; Set the variable pitch face (document text)
    (set-face-attribute 'variable-pitch nil :font d/variable-width-font :height default-variable-font-size :weight 'medium))
#+end_src

* 📑 Cleanliness 
Keep folders and backuping files clean!
#+begin_src emacs-lisp
  (use-package no-littering
    :config
    ;; no-littering doesn't set this by default so we must place
    ;; auto save files in the same path as it uses for sessions
    (setq auto-save-file-name-transforms
          `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    ;;  (setq backup-directory-alist '(("." . "~/.config/emacs/backups")))
    (setq delete-old-versions -1)
    (setq version-control t)
    (setq vc-make-backup-files t))

  (setq make-backup-files t          ; backup of a file the first time it is saved.
        backup-by-copying t          ; don't clobber symlinks
        version-control t            ; version numbers for backup files
        vc-make-backup-files t       ; version control for git/vcs dirs
        delete-old-versions t        ; delete excess backup files silently
        delete-by-moving-to-trash t
        kept-old-versions 2          ; oldest versions to keep when a new numbered backup is made 
        kept-new-versions 2          ; newest versions to keep when a new numbered backup is made 
        auto-save-default t          ; auto-save every buffer that visits a file
        auto-save-timeout 20         ; number of seconds idle time before auto-save (default: 30)
        auto-save-interval 200       ; number of keystrokes between auto-saves (default: 300)
        create-lockfiles nil         ; don't use lockfiles (default: t)
        )

  (use-package savehist
    :init
    (savehist-mode)
    :custom
    (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring)))
#+end_src

* ⌨️ Better Bindings 
** Custom functions
#+begin_src emacs-lisp
  (defun split-and-follow-horizontally ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun split-and-follow-vertically ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))


  (defun d/refresh-buffer ()
    "Revert buffer without confirmation."
    (interactive)
    (revert-buffer :ignore-auto :noconfirm))

  (defun window-focus-mode ()
    "Make the window focused, it can toggled in and out"
    (interactive)
    (if (= 1 (length (window-list)))
        (jump-to-register '_)
      (progn
        (set-register '_ (list (current-window-configuration)))
        (delete-other-windows))))

  (defun d/edit-src-block ()
    "Makes editing src block focused in its respective major mode"
    (interactive)
    (if (org-in-src-block-p) (progn (org-edit-special) (window-focus-mode))
      (org-edit-src-abort)))

  (defun d/insert-unicodes (&rest filenames)
    "Inserts unicode character (emoji/icons) from given files"
    (insert
     (let* ((content
             (mapcar #'(lambda (file) (with-temp-buffer (insert-file-contents file) (split-string (buffer-string) "\n" t))) filenames))
            (options (apply #'append content))
            (selected-item (completing-read "Choose Icon 󰨈: " options))
            (fields (split-string selected-item)))
       (car fields))))

  (defun org-archive-done-tasks ()
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
     "/DONE" 'tree))

        #+end_src
** Respected binds
#+begin_src emacs-lisp

  (global-set-key (kbd "M-v") #'d/scroll-up)
  (global-set-key (kbd "C-v") #'d/scroll-down)
  (global-set-key (kbd "<f5>") #'d/refresh-buffer)
  (global-set-key (kbd "C-c d i") (lambda () (interactive)
                                    (d/insert-unicodes "~/d-git/d-bin/treasure/unicodes/emoji" "~/d-git/d-bin/treasure/unicodes/icons")))

  ;; Get rid of annoyance
  (global-unset-key (kbd "C-x C-z"))
  (global-unset-key (kbd "C-z"))

  ;;(define-key org-mode-map (kbd "C-c C-x C-s") #'org-archive-done-tasks)
  (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
  (global-set-key [C-tab] 'other-window)

  (global-set-key (kbd "C-x C-k") 'd/kill-buffer) ;; My func to clear cache along killing buffer
  (global-set-key (kbd "C-x k") 'kill-buffer)
  (global-set-key (kbd "M-%") 'query-replace-regexp) ;; Hail regexp searching!

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "M-z") 'zap-up-to-char)

  (global-set-key (kbd "M-u") 'upcase-dwim)
  (global-set-key (kbd "M-l") 'downcase-dwim)
  (global-set-key (kbd "M-c") 'capitalize-dwim)

  (defalias 'yes-or-no-p 'y-or-n-p) ;; Make confirmation messages easy and not a pain.

#+end_src
* 🎹 What Key? 
Many people know that emacs has lot of keychords, which aren't easy to remember, ~which-key~ is a package which shows cheatsheet for the keychords you press. Mostly will find helpful for ~C-x~ or ~C-c~ or (yours general key/leader key)
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-sort-uppercase-first nil
          which-key-add-column-padding 1
          which-key-max-display-columns nil
          which-key-min-display-lines 6
          which-key-side-window-slot -10
          which-key-side-window-max-height 0.25
          which-key-idle-delay 0.8
          which-key-max-description-length 25
          which-key-allow-imprecise-window-fit t
          which-key-separator " → " )
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

#+end_src

* 🍁 Helpful 
Helpful package to even elaborate on describe commands. Decreases many hassles.

#+begin_src emacs-lisp
  (use-package helpful
    :defer t
    :bind
    ("C-h f" . helpful-callable)
    ("C-h v" . helpful-variable)
    ("C-h k" . helpful-key)
    ("C-h x" . helpful-command)
    ("C-c C-d" . helpful-at-point)
    ("C-h F" . helpful-function)
    (:map helpful-mode-map
          ("q" . kill-buffer-and-window)))

#+end_src

* 🎨 Color-ify 
Coloured parentheses or hex values are really needed for some usecases, obviously you know it lol.
*Happy Ricing* but use Emacs Everywhere lol
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :defer t
    :hook (prog-mode . rainbow-delimiters-mode))
  (use-package rainbow-mode
    :defer t
    :hook (prog-mode . rainbow-mode)
    :bind ("C-c t c" . rainbow-mode))
#+end_src
* 🖱️ Good Mouse use? 
Just don't use mouse, try to stay with keyboard, feel like *Pro*!
But if you like clicks, tacks and ticks of you mouse, then go with it. (Mouse is a good invention lol)
#+begin_src emacs-lisp
  (setq scroll-conservatively 101) ;; value greater than 100 gets rid of half page jumping
  (setq mouse-wheel-scroll-amount nil)
  (setq mouse-wheel-progressive-speed t) ;; accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
#+end_src

* 😇 Minad - The Messiah 
[[https://github.com/minad][@minad]] is a great guy, It is one of the reason why I love Emacs and Moved here, and use it everywhere as much as Possible.
Just see his git repo issues, he has it all solved, and he will explain and converse with clear and good explanation, I wondered how could a man be so dedicated to Emacs so well with very positive approach. Consider trying his packages and if possible, do Donate to him.
Just Awesome, if it wasn't for his packages, I probably would never have tried Emacs. Now I hate vim/neovim, Idk why.

